package programmers.highScoreKit.hash;

public class AboutHash { // 해시

//    해시함수(해시 알고리즘) : 임의의 길이의 데이터를 고정된 길이의 데이터로 매핑
//    해시 함수에 의해 얻어지는 값은 해시 값, 해시 코드, 해시 체크섬, 해시
//    결정론적으로 작동한다.(예측한 그대로 동작, 같은 입력값은 항상 같은 결과로 나와야 한다.)
//    해시 함수의 성능은 해시 충돌 확률로 결정된다.

//    해시 충돌 : 서로 다른 두 개의 입력값에 대해 동일한 출력값을 내는 상황.
//    해시 함수가 무한한 정의역, 유한한 공역일 경우 비둘기집 원리에 의해 해시 충돌은 항상 존재
//    해시 출돌은 처리하는 방식으로는 체이닝(chaining)을 이용한 연결 리스트, 개방 번지화(open addressing)

//    해시 테이블, 해시 맵, 해시 표 : '키를 값'에 매핑할 수 있는 구조, 연관 배열 추가에 사용되는 자료구조.
//    주로 매우 빠른 데이터 검색을 위해 사용


    public static void main(String[] args) {

    }
}
